Здесь: БД на хостере -> типа обработка в пандасе -> БД на хостере.

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [58]:
# !pip install pymysql

Defaulting to user installation because normal site-packages is not writeable
Collecting pymysql
  Downloading PyMySQL-1.1.1-py3-none-any.whl.metadata (4.4 kB)
Downloading PyMySQL-1.1.1-py3-none-any.whl (44 kB)
Installing collected packages: pymysql
Successfully installed pymysql-1.1.1

In [14]:
import mysql.connector
import pymysql
from sqlalchemy import create_engine
from sqlalchemy import URL

In [16]:
from config import mysql_qm

In [18]:
sql_query = '''
    SELECT
        *
    FROM
        sales 
        INNER JOIN companies USING(Артель)
        INNER JOIN chaebols USING(Артель)
        INNER JOIN industries USING(Товар) 
        INNER JOIN regions USING(Град)
'''

In [20]:
with mysql.connector.connect(
            host=mysql_qm['host'], 
            user=mysql_qm['user'], 
            password=mysql_qm['password'], 
            database=mysql_qm['database'], 
            ) as connection:
    df = pd.read_sql(sql_query, connection)

C:\Users\Боря\AppData\Local\Temp\ipykernel_14044\177267533.py:7: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql(sql_query, connection)

In [22]:
df = df[['Дата', 'Плата', 'Артель', 'Чеболь', 'Товар', 'Промысел', 'Град', 'Царство', ]]

In [24]:
df.Дата = pd.to_datetime(df.Дата)

In [26]:
df.head()

,Дата,Плата,Артель,Чеболь,Товар,Промысел,Град,Царство
0,2048-01-01,10208.64,Каша из топора,Дуремар,веган,яства,Пушград,Лукоморье
1,2048-01-01,21961.11,Бабки Ёжки,Синдбад,порошки,зелья,Пушград,Лукоморье
2,2048-01-01,6905.58,Хоббитонские угощения,Синдбад,сласти,яства,Пушград,Лукоморье
3,2048-01-01,4571.70,Дырявый котёл,Дуремар,киселя,яства,Лукоморск,Лукоморье
4,2048-01-01,15124.69,Ёлки-палки,Синдбад,палочки,артефакторика,Тумантархан,Тмутаракань

In [28]:
cube = df.groupby(['Чеболь', 'Промысел', 'Царство', ]).Плата.sum().round(2).reset_index()

In [30]:
cube = cube.rename(columns={'Плата': 'Сумма_продаж'})

In [32]:
cube.head()

    Чеболь       Промысел     Царство  Сумма_продаж
0  Дуремар  артефакторика   Лукоморье      54196.00
1  Дуремар  артефакторика      Нарния     126804.89
2  Дуремар  артефакторика  Тридесятое     110733.37
3  Дуремар        всячина   Лукоморье      74514.85
4  Дуремар        всячина      Нарния      24891.29

запишем полученную таблицу в БД

In [34]:
sql_create_query = '''
    CREATE TABLE IF NOT EXISTS cube (
        Чеболь       VARCHAR(64), 
        Промысел     VARCHAR(64), 
        Царство      VARCHAR(64), 
        Сумма_продаж DECIMAL(10, 2)
    )
'''

In [36]:
with mysql.connector.connect(
            host=mysql_qm['host'],
            user=mysql_qm['user'], 
            password=mysql_qm['password'],
            database=mysql_qm['database'], 
            ) as connection:
    with connection.cursor() as cursor:
        cursor.execute(sql_create_query)

In [38]:
url_object = URL.create(
    'mysql+pymysql',
    username=mysql_qm['user'],
    password=mysql_qm['password'], 
    host=mysql_qm['host'],
    port=mysql_qm['port'],
    database=mysql_qm['database'],
)

In [40]:
engine = create_engine(url_object)

In [46]:
cube.to_sql(
    name='cube', # имя таблицы
    con=engine,  # движок
    if_exists="replace", # если в таблице данные уже есть, заменяем их
    index=False # без индекса датафрейма
)

42